package com.task.fifth.oopCalendar;

//Создать класс Календарь с внутренним классом, с помощью объектов
// которого можно хранить информацию о выходных и праздничных днях

public class Main {

    public static void main(String[] args) {

        System.out.println(new Calendar(2019).allHolToString());
    }
}
